Almighty42/MSPM0G3507-System-Library/inc/mspm0g350x_iomux.h
#define IOMUX_PIN_PA7_PF_GPIO                              0x01
#define IOMUX_PIN_PA7_PF_COMP0_OUT                         0x02
#define IOMUX_PIN_PA7_PF_CLK_OUT                           0x03
#define IOMUX_PIN_PA7_PF_TIMG8_C0                          0x04
#define IOMUX_PIN_PA7_PF_TIMA0_C2                          0x05
#define IOMUX_PIN_PA7_PF_TIMG8_IDX                         0x06
#define IOMUX_PIN_PA7_PF_TIMG7_C1                          0x07
#define IOMUX_PIN_PA7_PF_TIMA0_C1                          0x08

#define IOMUX_PIN_PA8_PF_GPIO                              0x01
#define IOMUX_PIN_PA8_PF_UART1_TX                          0x02
#define IOMUX_PIN_PA8_PF_SPI0_CS0                          0x03
#define IOMUX_PIN_PA8_PF_UART0_RTS                         0x04
#define IOMUX_PIN_PA8_PF_TIMA0_C0                          0x05
#define IOMUX_PIN_PA8_PF_TIMA1_C0N                         0x06

#define IOMUX_PIN_PA9_PF_GPIO                              0x01
#define IOMUX_PIN_PA9_PF_UART1_RX                          0x02
#define IOMUX_PIN_PA9_PF_SPI0_PICO                         0x03
#define IOMUX_PIN_PA9_PF_UART0_CTS                         0x04
#define IOMUX_PIN_PA9_PF_TIMA0_C1                          0x05
#define IOMUX_PIN_PA9_PF_RTC_OUT                           0x06
#define IOMUX_PIN_PA9_PF_TIMA0_C0N                         0x07
#define IOMUX_PIN_PA9_PF_TIMA1_C1N                         0x08
#define IOMUX_PIN_PA9_PF_CLK_OUT                           0x09

#define IOMUX_PIN_PA10_PF_GPIO                             0x01
#define IOMUX_PIN_PA10_PF_UART0_TX                         0x02
#define IOMUX_PIN_PA10_PF_SPI_POCI                         0x03
#define IOMUX_PIN_PA10_PF_I2C0_SDA                         0x04
#define IOMUX_PIN_PA10_PF_TIMA1_C0                         0x05
#define IOMUX_PIN_PA10_PF_TIMG12_C0                        0x06
#define IOMUX_PIN_PA10_PF_TIMA0_C2                         0x07
#define IOMUX_PIN_PA10_PF_I2C1_SDA                         0x08
#define IOMUX_PIN_PA10_PF_CLK_OUT                          0x09

#define IOMUX_PIN_PA11_PF_GPIO                             0x01
#define IOMUX_PIN_PA11_PF_UART0_RX                         0x02
#define IOMUX_PIN_PA11_PF_SPI0_SCK                         0x03
#define IOMUX_PIN_PA11_PF_I2C0_SCL                         0x04
#define IOMUX_PIN_PA11_PF_TIMA1_C1                         0x05
#define IOMUX_PIN_PA11_PF_COMP0_OUT                        0x06
#define IOMUX_PIN_PA11_PF_TIMA0_C2N                        0x07
#define IOMUX_PIN_PA11_PF_I2C1_SCL                         0x08

#define IOMUX_PIN_PA12_PF_GPIO                             0x01
#define IOMUX_PIN_PA12_PF_UART3_CTS                        0x02
#define IOMUX_PIN_PA12_PF_SPI0_SCK                         0x03
#define IOMUX_PIN_PA12_PF_TIMG0_C0                         0x04
#define IOMUX_PIN_PA12_PF_CAN_TX                           0x05
#define IOMUX_PIN_PA12_PF_TIMA0_C3                         0x06
#define IOMUX_PIN_PA12_PF_FCC_IN                           0x07

#define IOMUX_PIN_PA13_PF_GPIO                             0x01
#define IOMUX_PIN_PA13_PF_UART3_RTS                        0x02
#define IOMUX_PIN_PA13_PF_SPI0_POCI                        0x03
#define IOMUX_PIN_PA13_PF_UART3_RX                         0x04
#define IOMUX_PIN_PA13_PF_TIMG0_C1                         0x05
#define IOMUX_PIN_PA13_PF_CAN_RX                           0x06
#define IOMUX_PIN_PA13_PF_TIMA0_C3N                        0x07

#define IOMUX_PIN_PA14_PF_GPIO                             0x01
#define IOMUX_PIN_PA14_PF_UART0_CTS                        0x02
#define IOMUX_PIN_PA14_PF_SPI0_PICO                        0x03
#define IOMUX_PIN_PA14_PF_UART3_TX                         0x04
#define IOMUX_PIN_PA14_PF_TIMG12_C0                        0x05
#define IOMUX_PIN_PA14_PF_CLK_OUT                          0x06

#define IOMUX_PIN_PA15_PF_GPIO                             0x01
#define IOMUX_PIN_PA15_PF_UART0_RTS                        0x02
#define IOMUX_PIN_PA15_PF_SPI1_CS2                         0x03
#define IOMUX_PIN_PA15_PF_I2C1_SCL                         0x04
#define IOMUX_PIN_PA15_PF_TIMA1_C0                         0x05
#define IOMUX_PIN_PA15_PF_TIMG8_IDX                        0x06
#define IOMUX_PIN_PA15_PF_TIMA1_C0N                        0x07
#define IOMUX_PIN_PA15_PF_TIMA0_C2                         0x08

#define IOMUX_PIN_PA16_PF_GPIO                             0x01
#define IOMUX_PIN_PA16_PF_COMP2_OUT                        0x02
#define IOMUX_PIN_PA16_PF_SPI1_POCI                        0x03
#define IOMUX_PIN_PA16_PF_I2C1_SDA                         0x04
#define IOMUX_PIN_PA16_PF_TIMA1_C1                         0x05
#define IOMUX_PIN_PA16_PF_TIMA1_C1N                        0x06
#define IOMUX_PIN_PA16_PF_TIMA0_C2N                        0x07
#define IOMUX_PIN_PA16_PF_FCC_IN                           0x08

#define IOMUX_PIN_PA17_GPIO                                0x01
#define IOMUX_PIN_PA17_UART1_TX                            0x02
#define IOMUX_PIN_PA17_SPI1_SCK                            0x03
#define IOMUX_PIN_PA17_I2C1_SCL                            0x04
#define IOMUX_PIN_PA17_TIMA0_C3                            0x05
#define IOMUX_PIN_PA17_TIMG7_C0                            0x06
#define IOMUX_PIN_PA17_TIMA1_C0                            0x07

#define IOMUX_PIN_PA18_GPIO                                0x01
#define IOMUX_PIN_PA18_UART1_RX                            0x02
#define IOMUX_PIN_PA18_SPI1_PICO                           0x03
#define IOMUX_PIN_PA18_I2C1_SDA                            0x04
#define IOMUX_PIN_PA18_TIMA0_C3N                           0x05
#define IOMUX_PIN_PA18_TIMG7_C1                            0x06
#define IOMUX_PIN_PA18_TIMA1_C1                            0x07

#define IOMUX_PIN_PA19_PF_GPIO                             0x01
#define IOMUX_PIN_PA19_PF_SWDIO                            0x02

#define IOMUX_PIN_PA20_PF_GPIO                             0x01
#define IOMUX_PIN_PA20_PF_SWCLK                            0x02

#define IOMUX_PIN_PA21_PF_GPIO                             0x01
#define IOMUX_PIN_PA21_PF_UART2_TX                         0x02
#define IOMUX_PIN_PA21_PF_TIMG8_C0                         0x03
#define IOMUX_PIN_PA21_PF_UART1_CTS                        0x04
#define IOMUX_PIN_PA21_PF_TIMA0_C0                         0x05
#define IOMUX_PIN_PA21_PF_TIMG6_C0                         0x06

#define IOMUX_PIN_PA22_PF_GPIO                             0x01
#define IOMUX_PIN_PA22_PF_UART2_RX                         0x02
#define IOMUX_PIN_PA22_PF_TIMG8_C1                         0x03
#define IOMUX_PIN_PA22_PF_UART1_RTS                        0x04
#define IOMUX_PIN_PA22_PF_TIMA0_C1                         0x05
#define IOMUX_PIN_PA22_PF_CLK_OUT                          0x06
#define IOMUX_PIN_PA22_PF_TIMA0_C0N                        0x07
#define IOMUX_PIN_PA22_PF_TIMG6_C1                         0x08

