Almighty42/MSPM0G3507-System-Library/inc/mspm0g350x_iomux.h
#define IOMUX_PIN_PA23_PF_GPIO                             0x01
#define IOMUX_PIN_PA23_PF_UART2_TX                         0x02
#define IOMUX_PIN_PA23_PF_SPI0_CS3                         0x03
#define IOMUX_PIN_PA23_PF_TIMA0_C3                         0x04
#define IOMUX_PIN_PA23_PF_TIMG0_C0                         0x05
#define IOMUX_PIN_PA23_PF_UART3_CTS                        0x06
#define IOMUX_PIN_PA23_PF_TIMG7_C0                         0x07
#define IOMUX_PIN_PA23_PF_TIMG8_C0                         0x08

#define IOMUX_PIN_PA24_PF_GPIO                             0x01
#define IOMUX_PIN_PA24_PF_UART2_RX                         0x02
#define IOMUX_PIN_PA24_PF_SPI0_CS2                         0x03
#define IOMUX_PIN_PA24_PF_TIMA0_C3N                        0x04
#define IOMUX_PIN_PA24_PF_TIMG0_C1                         0x05
#define IOMUX_PIN_PA24_PF_UART3_RTS                        0x06
#define IOMUX_PIN_PA24_PF_TIMG7_C1                         0x07
#define IOMUX_PIN_PA24_PF_TIMA1_C1                         0x08

#define IOMUX_PIN_PA25_PF_GPIO                             0x01
#define IOMUX_PIN_PA25_PF_UART3_RX                         0x02
#define IOMUX_PIN_PA25_PF_SPI1_CS3                         0x03
#define IOMUX_PIN_PA25_PF_TIMG12_C1                        0x04
#define IOMUX_PIN_PA25_PF_TIMA0_C3                         0x05
#define IOMUX_PIN_PA25_PF_TIMA0_C1N                        0x06

#define IOMUX_PIN_PA26_PF_GPIO                             0x01
#define IOMUX_PIN_PA26_PF_UART3_TX                         0x02
#define IOMUX_PIN_PA26_PF_SPI1_CS0                         0x03
#define IOMUX_PIN_PA26_PF_TIMG8_C0                         0x04
#define IOMUX_PIN_PA26_PF_TIMA_FAL0                        0x05
#define IOMUX_PIN_PA26_PF_CAN_TX                           0x06
#define IOMUX_PIN_PA26_PF_TIMG7_C0                         0x07

#define IOMUX_PIN_PA27_PF_GPIO                              0x01
#define IOMUX_PIN_PA27_PF_RTC_OUT                           0x02
#define IOMUX_PIN_PA27_PF_SPI1_CS1                          0x03
#define IOMUX_PIN_PA27_PF_TIMG8_C1                          0x04
#define IOMUX_PIN_PA27_PF_TIMA_FAL2                         0x05
#define IOMUX_PIN_PA27_PF_CAN_RX                            0x06
#define IOMUX_PIN_PA27_PF_TIMG7_C1                          0x07

#define IOMUX_PIN_PA28_PF_GPIO                              0x01
#define IOMUX_PIN_PA28_PF_UART0_TX                          0x02
#define IOMUX_PIN_PA28_PF_I2C0_SDA                          0x03
#define IOMUX_PIN_PA28_PF_TIMA0_C3                          0x04
#define IOMUX_PIN_PA28_PF_TIMA_FAL0                         0x05
#define IOMUX_PIN_PA28_PF_TIMG7_C0                          0x06
#define IOMUX_PIN_PA28_PF_TIMA1_C0                          0x07

#define IOMUX_PIN_PA29_PF_GPIO                              0x01
#define IOMUX_PIN_PA29_PF_I2C1_SCL                          0x02
#define IOMUX_PIN_PA29_PF_UART2_RTS                         0x03
#define IOMUX_PIN_PA29_PF_TIMG8_C0                          0x04
#define IOMUX_PIN_PA29_PF_TIMG6_C0                          0x05

#define IOMUX_PIN_PA30_PF_GPIO                              0x01
#define IOMUX_PIN_PA30_PF_I2C1_SDA                          0x02
#define IOMUX_PIN_PA30_PF_UART2_CTS                         0x03
#define IOMUX_PIN_PA30_PF_TIMG8_C1                          0x04
#define IOMUX_PIN_PA30_PF_TIMG6_C1                          0x05

#define IOMUX_PIN_PA31_PF_GPIO                              0x01
#define IOMUX_PIN_PA31_PF_UART0_RX                          0x02
#define IOMUX_PIN_PA31_PF_I2C0_SCL                          0x03
#define IOMUX_PIN_PA31_PF_TIMA0_C3N                         0x04
#define IOMUX_PIN_PA31_PF_TIMG12_C1                         0x05
#define IOMUX_PIN_PA31_PF_CLK_OUT                           0x06
#define IOMUX_PIN_PA31_PF_TIMG7_C1                          0x07
#define IOMUX_PIN_PA31_PF_TIMA1_C1                          0x08

#define IOMUX_PIN_PB0_PF_GPIO                               0x01
#define IOMUX_PIN_PB0_PF_UART0_TX                           0x02
#define IOMUX_PIN_PB0_PF_SPI1_CS2                           0x03
#define IOMUX_PIN_PB0_PF_TIMA1_C0                           0x04
#define IOMUX_PIN_PB0_PF_TIMA0_C2                           0x05

#define IOMUX_PIN_PB1_PF_GPIO                               0x01
#define IOMUX_PIN_PB1_PF_UART0_RX                           0x02
#define IOMUX_PIN_PB1_PF_SPI1_CS3                           0x03
#define IOMUX_PIN_PB1_PF_TIMA1_C1                           0x04
#define IOMUX_PIN_PB1_PF_TIMA0_C2N                          0x05

#define IOMUX_PIN_PB2_PF_GPIO                               0x01
#define IOMUX_PIN_PB2_PF_UART3_TX                           0x02
#define IOMUX_PIN_PB2_PF_UART2_CTS                          0x03
#define IOMUX_PIN_PB2_PF_I2C1_SCL                           0x04
#define IOMUX_PIN_PB2_PF_TIMA0_C3                           0x05
#define IOMUX_PIN_PB2_PF_UART1_CTS                          0x06
#define IOMUX_PIN_PB2_PF_TIMG6_C0                           0x07
#define IOMUX_PIN_PB2_PF_TIMA1_C0                           0x08

#define IOMUX_PIN_PB3_PF_GPIO                               0x01
#define IOMUX_PIN_PB3_PF_UART3_RX                           0x02
#define IOMUX_PIN_PB3_PF_UART2_RTS                          0x03
#define IOMUX_PIN_PB3_PF_I2C1_SDA                           0x04
#define IOMUX_PIN_PB3_PF_TIMA0_C3N                          0x05
#define IOMUX_PIN_PB3_PF_UART1_RTS                          0x06
#define IOMUX_PIN_PB3_PF_TIMG6_C1                           0x07
#define IOMUX_PIN_PB3_PF_TIMA1_C1                           0x08

#define IOMUX_PIN_PB4_PF_GPIO                               0x01
#define IOMUX_PIN_PB4_PF_UART1_TX                           0x02
#define IOMUX_PIN_PB4_PF_UART3_CTS                          0x03
#define IOMUX_PIN_PB4_PF_TIMA1_C0                           0x04
#define IOMUX_PIN_PB4_PF_TIMA0_C2                           0x05
#define IOMUX_PIN_PB4_PF_TIMA1_C0N                          0x06

#define IOMUX_PIN_PB5_PF_GPIO                               0x01
#define IOMUX_PIN_PB5_PF_UART1_RX                           0x02
#define IOMUX_PIN_PB5_PF_UART3_RTS                          0x03
#define IOMUX_PIN_PB5_PF_TIMA1_C1                           0x04
#define IOMUX_PIN_PB5_PF_TIMA0_C2N                          0x05
#define IOMUX_PIN_PB5_PF_TIMA1_C1N                          0x06

