Almighty42/MSPM0G3507-System-Library/inc/mspm0g350x_iomux.h
#define IOMUX_PIN_PB6_PF_GPIO                               0x01
#define IOMUX_PIN_PB6_PF_UART1_TX                           0x02
#define IOMUX_PIN_PB6_PF_SPI1_CS0                           0x03
#define IOMUX_PIN_PB6_PF_SPI0_CS1                           0x04
#define IOMUX_PIN_PB6_PF_TIMG8_C0                           0x05
#define IOMUX_PIN_PB6_PF_UART2_CTS                          0x06
#define IOMUX_PIN_PB6_PF_TIMG6_C0                           0x07
#define IOMUX_PIN_PB6_PF_TIMA1_C0N                          0x08

#define IOMUX_PIN_PB7_PF_GPIO                               0x01
#define IOMUX_PIN_PB7_PF_UART1_RX                           0x02
#define IOMUX_PIN_PB7_PF_SPI1_POCI                          0x03
#define IOMUX_PIN_PB7_PF_SPI0_CS2                           0x04
#define IOMUX_PIN_PB7_PF_TIMG8_C1                           0x05
#define IOMUX_PIN_PB7_PF_UART2_RTS                          0x06
#define IOMUX_PIN_PB7_PF_TIMG6_C1                           0x07
#define IOMUX_PIN_PB7_PF_TIMA1_C1N                          0x08

#define IOMUX_PIN_PB8_PF_GPIO                               0x01
#define IOMUX_PIN_PB8_PF_UART1_CTS                          0x02
#define IOMUX_PIN_PB8_PF_SPI1_PICO                          0x03
#define IOMUX_PIN_PB8_PF_TIMA0_C0                           0x04
#define IOMUX_PIN_PB8_PF_COMP1_OUT                          0x05

#define IOMUX_PIN_PB9_PF_GPIO                               0x01
#define IOMUX_PIN_PB9_PF_UART1_RTS                          0x02
#define IOMUX_PIN_PB9_PF_SPI1_SCK                           0x03
#define IOMUX_PIN_PB9_PF_TIMA0_C1                           0x04
#define IOMUX_PIN_PB9_PF_TIMA0_C0N                          0x05

#define IOMUX_PIN_PB10_PF_GPIO                              0x01
#define IOMUX_PIN_PB10_PF_TIMG0_C0                          0x02
#define IOMUX_PIN_PB10_PF_TIMG8_C0                          0x03
#define IOMUX_PIN_PB10_PF_COMP1_OUT                         0x04
#define IOMUX_PIN_PB10_PF_TIMG6_C0                          0x05

#define IOMUX_PIN_PB11_PF_GPIO                              0x01
#define IOMUX_PIN_PB11_PF_TIMG0_C1                          0x02
#define IOMUX_PIN_PB11_PF_TIMG8_C1                          0x03
#define IOMUX_PIN_PB11_PF_CLK_OUT                           0x04
#define IOMUX_PIN_PB11_PF_TIMG6_C1                          0x05

#define IOMUX_PIN_PB12_PF_GPIO                              0x01
#define IOMUX_PIN_PB12_PF_UART3_TX                          0x02
#define IOMUX_PIN_PB12_PF_TIMA0_C2                          0x03
#define IOMUX_PIN_PB12_PF_TIMA_FAL1                         0x04
#define IOMUX_PIN_PB12_PF_TIMA0_C1                          0x05

#define IOMUX_PIN_PB13_PF_GPIO                              0x01
#define IOMUX_PIN_PB13_PF_UART3_RX                          0x02
#define IOMUX_PIN_PB13_PF_TIMA0_C3                          0x03
#define IOMUX_PIN_PB13_PF_TIMG12_C0                         0x04
#define IOMUX_PIN_PB13_PF_TIMA0_C1N                         0x05

#define IOMUX_PIN_PB14_PF_GPIO                              0x01
#define IOMUX_PIN_PB14_PF_SPI1_CS3                          0x02
#define IOMUX_PIN_PB14_PF_SPI1_POCI                         0x03
#define IOMUX_PIN_PB14_PF_SPI0_CS3                          0x04
#define IOMUX_PIN_PB14_PF_TIMG12_C1                         0x05
#define IOMUX_PIN_PB14_PF_TIMG8_IDX                         0x06
#define IOMUX_PIN_PB14_PF_TIMA0_C0                          0x07

#define IOMUX_PIN_PB15_PF_GPIO                              0x01
#define IOMUX_PIN_PB15_PF_UART2_TX                          0x02
#define IOMUX_PIN_PB15_PF_SPI1_PICO                         0x03
#define IOMUX_PIN_PB15_PF_UART3_CTS                         0x04
#define IOMUX_PIN_PB15_PF_TIMG8_C0                          0x05
#define IOMUX_PIN_PB15_PF_TIMG7_C0                          0x06

#define IOMUX_PIN_PB16_PF_GPIO                              0x01
#define IOMUX_PIN_PB16_PF_UART2_RX                          0x02
#define IOMUX_PIN_PB16_PF_SPI1_SCK                          0x03
#define IOMUX_PIN_PB16_PF_UART3_RTS                         0x04
#define IOMUX_PIN_PB16_PF_TIMG8_C1                          0x05
#define IOMUX_PIN_PB16_PF_TIMG7_C1                          0x06

#define IOMUX_PIN_PB17_PF_GPIO                              0x01
#define IOMUX_PIN_PB17_PF_UART2_TX                          0x02
#define IOMUX_PIN_PB17_PF_SPI0_PICO                         0x03
#define IOMUX_PIN_PB17_PF_SPI1_CS1                          0x04
#define IOMUX_PIN_PB17_PF_TIMA1_C0                          0x05
#define IOMUX_PIN_PB17_PF_TIMA0_C2                          0x06

#define IOMUX_PIN_PB18_PF_GPIO                              0x01
#define IOMUX_PIN_PB18_PF_UART2_RX                          0x02
#define IOMUX_PIN_PB18_PF_SPI0_SCK                          0x03
#define IOMUX_PIN_PB18_PF_SPI1_CS2                          0x04
#define IOMUX_PIN_PB18_PF_TIMA1_C1                          0x05
#define IOMUX_PIN_PB18_PF_TIMA0_C2N                         0x06

#define IOMUX_PIN_PB19_PF_GPIO                              0x01
#define IOMUX_PIN_PB19_PF_COMP2_OUT                         0x02
#define IOMUX_PIN_PB19_PF_SPI0_POCI                         0x03
#define IOMUX_PIN_PB19_PF_TIMG8_C1                          0x04
#define IOMUX_PIN_PB19_PF_UART0_CTS                         0x05
#define IOMUX_PIN_PB19_PF_TIMG7_C1                          0x06

#define IOMUX_PIN_PB20_PF_GPIO                              0x01
#define IOMUX_PIN_PB20_PF_SPI0_CS2                          0x02
#define IOMUX_PIN_PB20_PF_SPI1_CS0                          0x03
#define IOMUX_PIN_PB20_PF_TIMA0_C2                          0x04
#define IOMUX_PIN_PB20_PF_TIMG12_C0                         0x05
#define IOMUX_PIN_PB20_PF_TIMA_FAL1                         0x06
#define IOMUX_PIN_PB20_PF_TIMA0_C1                          0x07
#define IOMUX_PIN_PB20_PF_TIMA1_C1N                         0x08

#define IOMUX_PIN_PB21_PF_GPIO                              0x01
#define IOMUX_PIN_PB21_PF_SPI1_POCI                         0x02
#define IOMUX_PIN_PB21_PF_TIMG8_C0                          0x03

#define IOMUX_PIN_PB22_PF_GPIO                              0x01
#define IOMUX_PIN_PB22_PF_SPI1_PICO                         0x02
#define IOMUX_PIN_PB22_PF_TIMG8_C1                          0x03

#define IOMUX_PIN_PB23_PF_GPIO                              0x01
#define IOMUX_PIN_PB23_PF_SPI1_SCK                          0x02
#define IOMUX_PIN_PB23_PF_COMP0_OUT                         0x03
#define IOMUX_PIN_PB23_PF_TIMA_FAL0                         0x04

#define IOMUX_PIN_PB24_PF_GPIO                              0x01
#define IOMUX_PIN_PB24_PF_SPI0_CS3                          0x02
#define IOMUX_PIN_PB24_PF_SPI0_CS1                          0x03
#define IOMUX_PIN_PB24_PF_TIMA0_C3                          0x04
#define IOMUX_PIN_PB24_PF_TIMG12_C1                         0x05
#define IOMUX_PIN_PB24_PF_TIMA0_C1N                         0x06
#define IOMUX_PIN_PB24_PF_TIMA1_C0N                         0x07

#define IOMUX_PIN_PB25_PF_GPIO                              0x01
#define IOMUX_PIN_PB25_PF_UART0_CTS                         0x02
#define IOMUX_PIN_PB25_PF_SPI0_CS0                          0x03
#define IOMUX_PIN_PB25_PF_TIMA_FAL2                         0x04

#define IOMUX_PIN_PB26_PF_GPIO                              0x01
#define IOMUX_PIN_PB26_PF_UART0_RTS                         0x02
#define IOMUX_PIN_PB26_PF_SPI0_CS1                          0x03
#define IOMUX_PIN_PB26_PF_TIMA0_C3                          0x04
#define IOMUX_PIN_PB26_PF_TIMG6_C0                          0x05
#define IOMUX_PIN_PB26_PF_TIMA1_C0                          0x06

#define IOMUX_PIN_PB27_PF_GPIO                              0x01
#define IOMUX_PIN_PB27_PF_COMP2_OU                          0x02
#define IOMUX_PIN_PB27_PF_SPI1_CS2                          0x03
#define IOMUX_PIN_PB27_PF_TIMA0_C3N                         0x04
#define IOMUX_PIN_PB27_PF_TIMG6_C1                          0x05
#define IOMUX_PIN_PB27_PF_TIMA1_C1                          0x06

// USAGE: --- @IOMUX_PC ---

#define IOMUX_PC_DISCONNECT         0
#define IOMUX_PC_CONNECT            1

// USAGE: --- @IOMUX_PUPD_CONTROL ---

#define IOMUX_PULL_NONE             0
#define IOMUX_PULL_UP               1
#define IOMUX_PULL_DOWN             2

// USAGE --- @IOMUX_DRIVE ---

#define IOMUX_DRIVE_LOW             0
#define IOMUX_DRIVE_HIGH            0

// USAGE --- @IOMUX_INPUT_STATE

#define IOMUX_STATE_DISABLE         0
#define IOMUX_STATE_ENABLE          1

void iomux_configure_pin(const iomux_pin_config_t *cfg);

#endif
